"""
pm_formula_params PM风险公式所需的系数, 每个参数对应的变量值如下:
b PM超标的天数 M
f 是否发热 F
t 均温 T
w 风速 W
r 累计降水量 R
u 按个体有差异 s
"""
pm_formula_params = {
    "wk1": {
        "pm_25": {
            "b": 0.0463,
            "f": 2.9594,
            "t": 0,
            "w": 0,
            "r": 0,
            "u": 0
        },
        "pm_10": {
            "b": 0.0306,
            "f": 2.9596,
            "t": 0,
            "w": -0.0858,
            "r": 0,
            "u": 0
        }
    },
    "wk2": {
        "pm_25": {
            "b": 0.0475,
            "f": 2.9596,
            "t": 0.0215,
            "w": 0,
            "r": 0,
            "u": 0
        },
        "pm_10": {
            "b": 0.0263,
            "f": 2.9589,
            "t": 0.0139,
            "w": -0.0972,
            "r": 0,
            "u": 0
        }
    }
}

# 参考以下风速等级表
# 风速 = (最小风速+最大风速) / 2 求出
# https://baike.baidu.com/item/%E9%A3%8E%E5%8A%9B%E7%AD%89%E7%BA%A7/8477486
wind_power_speed_map = {
    "0": 0.1,
    "1": 0.9,
    "2": 2.45,
    "3": 4.4,
    "4": 6.7,
    "5": 9.35,
    "6": 12.3,
    "7": 15.5,
    "8": 18.95,
    "9": 22.6,
    "10": 26.45,
    "11": 30.55,
    "12": 35.3,
    "13": 39.2,
    "14": 43.8,
    "15": 48.55,
    "16": 53.5,
    "17": 58.65,
    "18": 61.3
}

# risk_comment 表, 等级对应获哮喘概率如下
risk_level_map = {
    "1" : 0.2,
    "2" : 0.4,
    "3" : 0.6,
    "4" : 0.8,
    "5" : 1
}

# PM超标阈值
# pm2.5 35ug 每立方米
# pm10 50ug 每立方米
pm_25_threshold = 35
pm_10_threshold = 50